# python data types

In [17]:
# 1. boolean data (0 or 1, False or True, No or Yes)
a = True
b = False 
type(a)

bool

In [2]:
print ("hi my name is jess")

hi my name is jess

In [3]:
# function (perameter)

In [4]:
# 2. integer data
multiply = 4*4
type(multiply)

int

In [5]:
# 3. float data
c=3.4323
divide = 4/4
print (divide)

1.0

In [6]:
type (divide)

float

In [7]:
# string data
fname = 'jess'
lname='vinskus'
type(fname)

str

In [8]:
d=2
e=c+d
print (e)
# float takes precident over integers

5.4323

In [9]:
type(c)

float

In [10]:
ctoint= int(c)
print(ctoint)

3

In [11]:
dtofloat = float (d)
print (dtofloat)

2.0

In [12]:
type(fname)

str

In [13]:
fullname= fname+lname
print(fullname)

jessvinskus

In [14]:
funame = fname+ " "+lname
funame

'jess vinskus'

In [15]:
print( funame + " "+ "is" +" 21 years old")
age= 21
ages= "21 years old"

jess vinskus is 21 years old

In [16]:
print(f'{funame} is {age} years old')

jess vinskus is 21 years old

In [19]:
print(f' {c} is not {d}')

 3.4323 is not 2

In [20]:
stringval='3.333'
floatval=float(stringval)

In [22]:
type(floatval)

float

In [23]:
intval2=int(floatval)
intval2

3

# python data structures

In [44]:
# 1. lists are containers
mylist=[1,2,3,4,5,6,7,8,9,10]
#indexing in python
#index=[0,1,2,3,4,5,6,7,8,9] (starts at 0)
#      [-11,-10,-9,-8,-7,-6,-5,-4,-3,-2,-1] can index in reverse
mylist[-1]

10

In [37]:
mylist2=[45.67, 33.21, ['jess', "vinskus"], 100]
mylist2[2][0]

'jess'

In [38]:
city=['Burlington', 'Potrland', 'Concord', 'Boston', 'Worcester', 'Providence', 'Hartford']

In [39]:
len(city)

7

In [49]:
city[2]

'Concord'

In [51]:
# when indexing a range it excludes the value at the end
# must go out one higher
nne=city[0:3]
print(nne)

['Burlington', 'Potrland', 'Concord']

In [53]:
city2=city
print(city2)

['Burlington', 'Potrland', 'Concord', 'Boston', 'Worcester', 'Providence', 'Hartford']

In [58]:
city2.append('Mt. Washington')
city2

['Burlington',
 'Concord',
 'Boston',
 'Worcester',
 'Providence',
 'Hartford',
 'Mt. Washington']

In [59]:
city2.pop(1)
city2

['Burlington',
 'Boston',
 'Worcester',
 'Providence',
 'Hartford',
 'Mt. Washington']

In [60]:
# 2. tuples, cannot be modified
mytuple=(1,2,3,4,5,6,7,8,9,10)
mytuple[1]

2

In [61]:
# cannot mytuple.append or pop

In [62]:
mytuplelist=list(mytuple)
mytuplelist

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [63]:
# 3. dictonaries (key value pairs)
#1 to 1 or 1 to many
snowfall={'Burlington':81.2, 'Portland':61.9, 'Concord':61.4, 'Boston':43.8, 'Worcester':64.1, 'Providence':33.8, "Hartford":40.5}

In [64]:
snowfall['Burlington']
#indexing with brackets

81.2

In [66]:
snowfall2={'city':['Burlington', 'Portland', 'Concord'], 'snowfall':[81.2, 61.9, 61.4]}

In [70]:
import pandas as pd
snowdf=pd.DataFrame(snowfall2)
snowdf

         city  snowfall
0  Burlington      81.2
1    Portland      61.9
2     Concord      61.4